app/controllers/words_controller.rb

SELECT "words".* FROM "words"
---
  def index
    render json: Word.all

INSERT INTO "words" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-09-17 17:59:09.807306"], ["description", "a common description"], ["name", "hello"], ["updated_at", "2014-09-17 17:59:09.807306"]]
---
  def create
    render json: Word.create(word_params)